#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```terraform
module.e4ca1d-team.sysdig_monitor_dashboard.pv_usage: Refreshing state... [id=405695]
module.c6af30-team.sysdig_monitor_alert_metric.prod_keycloak_pods_high: Refreshing state... [id=10777724]
module.c6af30-team.sysdig_monitor_alert_metric.prod_keycloak_pods_low: Refreshing state... [id=10777730]
module.c6af30-team.sysdig_monitor_alert_metric.prod_keycloak_cpu_spike_high: Refreshing state... [id=10777728]
module.e4ca1d-team.sysdig_monitor_dashboard.pods_cpu: Refreshing state... [id=405694]
module.c6af30-team.sysdig_monitor_dashboard.pods_cpu: Refreshing state... [id=296848]
module.c6af30-team.sysdig_monitor_dashboard.pv_usage: Refreshing state... [id=296849]
module.e4ca1d-team.sysdig_monitor_dashboard.pv_overall: Refreshing state... [id=405696]
module.c6af30-team.sysdig_monitor_dashboard.pv_overall: Refreshing state... [id=296847]
module.e4ca1d-team.sysdig_monitor_dashboard.general_pod_performance: Refreshing state... [id=405697]
module.eb75ad-team.sysdig_monitor_alert_metric.prod_backup_storage_pv_usage_gt_med: Refreshing state... [id=9921933]
module.eb75ad-team.sysdig_monitor_alert_metric.test_backup_storage_pv_usage_gt_med: Refreshing state... [id=16074249]
module.eb75ad-team.sysdig_monitor_alert_metric.dev_backup_storage_pv_usage_gt_med: Refreshing state... [id=16074248]
module.c6af30-team.sysdig_monitor_alert_metric.prod_keycloak_cpu_usage_med: Refreshing state... [id=10777726]
module.c6af30-team.sysdig_monitor_alert_metric.prod_keycloak_cpu_usage_high: Refreshing state... [id=10777725]
module.c6af30-team.sysdig_monitor_alert_promql.prod_sso_db_pv_gt_80: Refreshing state... [id=10777733]
module.c6af30-team.sysdig_monitor_alert_metric.prod_db_pods_high: Refreshing state... [id=10777727]
module.c6af30-team.sysdig_monitor_alert_metric.prod_db_pods_low: Refreshing state... [id=10777732]
module.c6af30-team.sysdig_monitor_alert_metric.prod_keycloak_pods_med: Refreshing state... [id=10777734]
module.c6af30-team.sysdig_monitor_alert_metric.prod_db_pod_restarts_gte_1: Refreshing state... [id=10777729]
module.c6af30-team.sysdig_monitor_alert_promql.prod_sso_db_pv_gt_60: Refreshing state... [id=10777731]
module.eb75ad-team.sysdig_monitor_alert_downtime.prod_dr_pod_downtime: Refreshing state... [id=15346483]
module.eb75ad-team.sysdig_monitor_alert_metric.prod_keycloak_cpu_usage_high: Refreshing state... [id=9921898]
module.eb75ad-team.sysdig_monitor_dashboard.pv_overall: Refreshing state... [id=363087]
module.eb75ad-team.sysdig_monitor_alert_promql.prod_db_pv_usage_med: Refreshing state... [id=9921934]
module.eb75ad-team.sysdig_monitor_dashboard.pv_usage: Refreshing state... [id=363085]
module.eb75ad-team.sysdig_monitor_alert_metric.prod_keycloak_pods_low: Refreshing state... [id=9921901]
module.eb75ad-team.sysdig_monitor_alert_metric.prod_keycloak_pods_high: Refreshing state... [id=9921902]
module.eb75ad-team.sysdig_monitor_alert_metric.prod_keycloak_log_pv_med: Refreshing state... [id=9921922]
module.eb75ad-team.sysdig_monitor_alert_promql.dev_kc_disk_log_pv_usage_sixty: Refreshing state... [id=15959117]
module.eb75ad-team.sysdig_monitor_alert_promql.prod_db_pv_usage_high: Refreshing state... [id=16155976]
module.eb75ad-team.sysdig_monitor_dashboard.general_pod_performance: Refreshing state... [id=404905]
module.eb75ad-team.sysdig_monitor_alert_promql.prod_kc_disk_log_pv_usage_sixty: Refreshing state... [id=15959118]
module.eb75ad-team.sysdig_monitor_alert_downtime.dev_dr_pod_downtime: Refreshing state... [id=15338912]
module.eb75ad-team.sysdig_monitor_alert_promql.dev_db_pv_usage_ninety: Refreshing state... [id=14625871]
module.eb75ad-team.sysdig_monitor_alert_metric.prod_db_pod_restarts_gte_1: Refreshing state... [id=9921905]
module.eb75ad-team.sysdig_monitor_alert_metric.prod_keycloak_cpu_usage_med: Refreshing state... [id=9921903]
module.eb75ad-team.sysdig_monitor_alert_promql.dev_db_pv_usage_seventyfive: Refreshing state... [id=14625866]
module.eb75ad-team.sysdig_monitor_alert_metric.prod_keycloak_cpu_spike_high: Refreshing state... [id=9921904]
module.eb75ad-team.sysdig_monitor_alert_metric.prod_keycloak_log_pv_high: Refreshing state... [id=16155975]
module.eb75ad-team.sysdig_monitor_alert_metric.prod_db_pods_high: Refreshing state... [id=9921906]
module.eb75ad-team.sysdig_monitor_alert_downtime.test_dr_pod_downtime: Refreshing state... [id=15346484]
module.eb75ad-team.sysdig_monitor_alert_metric.prod_db_pods_low: Refreshing state... [id=9921900]
module.eb75ad-team.sysdig_monitor_alert_metric.prod_keycloak_cpu_usage_sustained: Refreshing state... [id=15961444]
module.eb75ad-team.sysdig_monitor_alert_metric.dev_dr_pod: Refreshing state... [id=15328793]
module.eb75ad-team.sysdig_monitor_alert_metric.test_dr_pod: Refreshing state... [id=15328794]
module.eb75ad-team.sysdig_monitor_alert_promql.prod_db_pv_usage_low: Refreshing state... [id=9921935]
module.eb75ad-team.sysdig_monitor_alert_promql.prod_minio_pvc_storage_low: Refreshing state... [id=14080753]
module.eb75ad-team.sysdig_monitor_alert_metric.prod_keycloak_pods_med: Refreshing state... [id=9921897]
module.eb75ad-team.sysdig_monitor_alert_promql.test_db_pv_usage_seventyfive: Refreshing state... [id=14625869]
module.eb75ad-team.sysdig_monitor_alert_metric.prod_dr_pod: Refreshing state... [id=15328795]
module.eb75ad-team.sysdig_monitor_dashboard.pods_cpu: Refreshing state... [id=363086]
module.eb75ad-team.sysdig_monitor_alert_promql.test_db_pv_usage_ninety: Refreshing state... [id=14625872]
module.eb75ad-team.sysdig_monitor_alert_promql.test_kc_disk_log_pv_usage_sixty: Refreshing state... [id=15959116]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.eb75ad-team.sysdig_monitor_alert_metric.dev_backup_storage_pv_usage_gt_med will be destroyed
  # (because sysdig_monitor_alert_metric.dev_backup_storage_pv_usage_gt_med is not in configuration)
  - resource "sysdig_monitor_alert_metric" "dev_backup_storage_pv_usage_gt_med" {
      - enabled               = true -> null
      - id                    = "16074248" -> null
      - metric                = "max(avg(sysdig_container_fs_used_percent)) > 85" -> null
      - multiple_alerts_by    = [] -> null
      - name                  = "[GOLD CUST DEV] DB Backup - storage 85%" -> null
      - notification_channels = [
          - 132277,
          - 57336,
          - 57341,
        ] -> null
      - scope                 = "kubernetes.cluster.name in (\"gold\") and kubernetes.namespace.name in (\"eb75ad-dev\") and kubernetes.deployment.name in (\"sso-backup-storage\")" -> null
      - severity              = 4 -> null
      - team                  = 40193 -> null
      - trigger_after_minutes = 2 -> null
      - version               = 1 -> null

      - custom_notification {
          - title = "{{__alert_name__}} is {{__alert_status__}}" -> null
        }
    }

  # module.eb75ad-team.sysdig_monitor_alert_metric.prod_backup_storage_pv_usage_gt_med will be destroyed
  # (because sysdig_monitor_alert_metric.prod_backup_storage_pv_usage_gt_med is not in configuration)
  - resource "sysdig_monitor_alert_metric" "prod_backup_storage_pv_usage_gt_med" {
      - enabled               = true -> null
      - id                    = "9921933" -> null
      - metric                = "max(avg(sysdig_container_fs_used_percent)) > 80" -> null
      - multiple_alerts_by    = [] -> null
      - name                  = "[GOLD CUST PROD] DB Backup - storage 80%" -> null
      - notification_channels = [
          - 132277,
          - 57336,
          - 57341,
        ] -> null
      - scope                 = "kubernetes.cluster.name in (\"gold\") and kubernetes.namespace.name in (\"eb75ad-prod\") and kubernetes.deployment.name in (\"sso-backup-storage\")" -> null
      - severity              = 4 -> null
      - team                  = 40193 -> null
      - trigger_after_minutes = 2 -> null
      - version               = 5 -> null

      - custom_notification {
          - title = "{{__alert_name__}} is {{__alert_status__}}" -> null
        }
    }

  # module.eb75ad-team.sysdig_monitor_alert_metric.prod_keycloak_log_pv_high will be updated in-place
  ~ resource "sysdig_monitor_alert_metric" "prod_keycloak_log_pv_high" {
      + description           = "This container filesystem is filling up."
        id                    = "16155975"
      ~ name                  = "[GOLD CUST PROD] SSO - Log PV Usage over 90%" -> "[GOLD CUST PROD] SSO - Keycloak Filesystem usage over 90%"
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.eb75ad-team.sysdig_monitor_alert_metric.prod_keycloak_log_pv_med will be updated in-place
  ~ resource "sysdig_monitor_alert_metric" "prod_keycloak_log_pv_med" {
      + description           = "This container filesystem is filling up."
        id                    = "9921922"
      ~ name                  = "[GOLD CUST PROD] SSO - Log PV Usage over 70%" -> "[GOLD CUST PROD] SSO - Keycloak Filesystem Usage over 70%"
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.eb75ad-team.sysdig_monitor_alert_metric.test_backup_storage_pv_usage_gt_med will be destroyed
  # (because sysdig_monitor_alert_metric.test_backup_storage_pv_usage_gt_med is not in configuration)
  - resource "sysdig_monitor_alert_metric" "test_backup_storage_pv_usage_gt_med" {
      - enabled               = true -> null
      - id                    = "16074249" -> null
      - metric                = "max(avg(sysdig_container_fs_used_percent)) > 85" -> null
      - multiple_alerts_by    = [] -> null
      - name                  = "[GOLD CUST TEST] DB Backup - storage 85%" -> null
      - notification_channels = [
          - 132277,
          - 57336,
          - 57341,
        ] -> null
      - scope                 = "kubernetes.cluster.name in (\"gold\") and kubernetes.namespace.name in (\"eb75ad-test\") and kubernetes.deployment.name in (\"sso-backup-storage\")" -> null
      - severity              = 4 -> null
      - team                  = 40193 -> null
      - trigger_after_minutes = 2 -> null
      - version               = 1 -> null

      - custom_notification {
          - title = "{{__alert_name__}} is {{__alert_status__}}" -> null
        }
    }

  # module.eb75ad-team.sysdig_monitor_alert_promql.dev_backup_storage_pv_usage_gt_med will be created
  + resource "sysdig_monitor_alert_promql" "dev_backup_storage_pv_usage_gt_med" {
      + description           = "This uses the filesystem as a proxy for PVC space."
      + enabled               = true
      + id                    = (known after apply)
      + name                  = "[GOLD CUST DEV] DB Backup - storage 85%"
      + notification_channels = [
          + 132277,
          + 57336,
          + 57341,
        ]
      + promql                = "avg(kubelet_volume_stats_used_bytes{namespace=\"eb75ad-dev\", persistentvolumeclaim=~\"sso-backup-storage-backup-pvc\"}*100 / kubelet_volume_stats_capacity_bytes{namespace=\"eb75ad-dev\", persistentvolumeclaim=~\"sso-backup-storage-backup-pvc\"}) by (persistentvolumeclaim) > 85"
      + severity              = 4
      + team                  = (known after apply)
      + trigger_after_minutes = 2
      + version               = (known after apply)

      + custom_notification {
          + title = "{{__alert_name__}} is {{__alert_status__}}"
        }
    }

  # module.eb75ad-team.sysdig_monitor_alert_promql.prod_backup_storage_pv_usage_gt_med will be created
  + resource "sysdig_monitor_alert_promql" "prod_backup_storage_pv_usage_gt_med" {
      + description           = "This uses the filesystem as a proxy for PVC space."
      + enabled               = true
      + id                    = (known after apply)
      + name                  = "[GOLD CUST PROD] DB Backup - storage 80%"
      + notification_channels = [
          + 132277,
          + 57336,
          + 57341,
        ]
      + promql                = "avg(kubelet_volume_stats_used_bytes{namespace=\"eb75ad-prod\", persistentvolumeclaim=~\"sso-backup-storage-backup-pvc\"}*100 / kubelet_volume_stats_capacity_bytes{namespace=\"eb75ad-prod\", persistentvolumeclaim=~\"sso-backup-storage-backup-pvc\"}) by (persistentvolumeclaim) > 80"
      + severity              = 4
      + team                  = (known after apply)
      + trigger_after_minutes = 2
      + version               = (known after apply)

      + custom_notification {
          + title = "{{__alert_name__}} is {{__alert_status__}}"
        }
    }

  # module.eb75ad-team.sysdig_monitor_alert_promql.test_backup_storage_pv_usage_gt_med will be created
  + resource "sysdig_monitor_alert_promql" "test_backup_storage_pv_usage_gt_med" {
      + description           = "This uses the filesystem as a proxy for PVC space."
      + enabled               = true
      + id                    = (known after apply)
      + name                  = "[GOLD CUST TEST] DB Backup - storage 85%"
      + notification_channels = [
          + 132277,
          + 57336,
          + 57341,
        ]
      + promql                = "avg(kubelet_volume_stats_used_bytes{namespace=\"eb75ad-test\", persistentvolumeclaim=~\"sso-backup-storage-backup-pvc\"}*100 / kubelet_volume_stats_capacity_bytes{namespace=\"eb75ad-test\", persistentvolumeclaim=~\"sso-backup-storage-backup-pvc\"}) by (persistentvolumeclaim) > 85"
      + severity              = 4
      + team                  = (known after apply)
      + trigger_after_minutes = 2
      + version               = (known after apply)

      + custom_notification {
          + title = "{{__alert_name__}} is {{__alert_status__}}"
        }
    }

Plan: 3 to add, 2 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @thegentlemanphysicist, Action: `pull_request`*